#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-7eJJNN5GQykXFAGg

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=qnvmgu9rlh]
module.security_demo.aws_api_gateway_resource.resource: Refreshing state... [id=al7w62]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=xct5vd]
module.security_demo.aws_api_gateway_model.model: Refreshing state... [id=eio5d0]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=155e333c-d687-4682-9d74-f62807218e7d]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-qnvmgu9rlh-al7w62-OPTIONS]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-qnvmgu9rlh-al7w62-OPTIONS]
module.security_demo.aws_api_gateway_method.method: Refreshing state... [id=agm-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-qnvmgu9rlh-al7w62-OPTIONS-200]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-qnvmgu9rlh-al7w62-OPTIONS-200]
module.security_demo.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-qnvmgu9rlh-al7w62-POST-200]
module.security_demo.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.security_demo.aws_api_gateway_integration.integration: Refreshing state... [id=agi-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=1lsitd]
module.security_demo.aws_api_gateway_stage.stage: Refreshing state... [id=ags-qnvmgu9rlh-test]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=35dwin]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=qnvmgu9rlh-test-*/*]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/155e333c-d687-4682-9d74-f62807218e7d,arn:aws:apigateway:us-east-1::/restapis/qnvmgu9rlh/stages/test]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.security_demo.aws_api_gateway_integration_response.options has changed
  ~ resource "aws_api_gateway_integration_response" "options" {
        id                  = "agir-qnvmgu9rlh-al7w62-OPTIONS-200"
      + response_templates  = {}
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.security_demo.aws_api_gateway_integration.root-options will be created
  + resource "aws_api_gateway_integration" "root-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = "y7ay07alpb"
      + rest_api_id          = "qnvmgu9rlh"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.security_demo.aws_api_gateway_integration_response.root-options will be created
  + resource "aws_api_gateway_integration_response" "root-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "y7ay07alpb"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "qnvmgu9rlh"
      + status_code         = "200"
    }

  # module.security_demo.aws_api_gateway_method.root-options will be created
  + resource "aws_api_gateway_method" "root-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = "y7ay07alpb"
      + rest_api_id      = "qnvmgu9rlh"
    }

  # module.security_demo.aws_api_gateway_method_response.root-options will be created
  + resource "aws_api_gateway_method_response" "root-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "y7ay07alpb"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "qnvmgu9rlh"
      + status_code         = "200"
    }

  # module.security_demo.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "tf_lambda"
      ~ last_modified                  = "2021-12-30T05:01:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "iYmDxmCIvGhyu3WmhwrUB/DVVp64DQ5t7KjZl+tZOUk=" -> "7T2lK5Uea7DsrVvPIWZP57O7Ev4R1ChL3L3906yXrGo="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*